---
type: UIFabricationUtils
namespace: Autodesk.Revit.UI
version: 2024
members: 6
tags: [revit-api, class]
---

# UIFabricationUtils

`Autodesk.Revit.UI.UIFabricationUtils` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetOpenConnectorIndicatorAwayColor | 2017 | `public static Color GetOpenConnectorIndicatorAwayColor ()` |
| Method | GetOpenConnectorIndicatorPlanColor | 2017 | `public static Color GetOpenConnectorIndicatorPlanColor ()` |
| Method | GetOpenConnectorIndicatorTowardsColor | 2017 | `public static Color GetOpenConnectorIndicatorTowardsColor ()` |
| Method | SetOpenConnectorIndicatorAwayColor | 2017 | `public static void SetOpenConnectorIndicatorAwayColor ( Color color )` |
| Method | SetOpenConnectorIndicatorPlanColor | 2017 | `public static void SetOpenConnectorIndicatorPlanColor ( Color color )` |
| Method | SetOpenConnectorIndicatorTowardsColor | 2017 | `public static void SetOpenConnectorIndicatorTowardsColor ( Color color )` |